chronoweb/src/main/resources/webroot/example/poll/SimpleEventQuery_basic/MATCH_inputEPCClass.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:query="urn:epcglobal:epcis-query:xsd:2"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header />
	<soapenv:Body>
		<query:Poll>
			<queryName>SimpleEventQuery</queryName>
			<params>
				<param>
					<name>MATCH_inputEPCClass</name>
					<value xsi:type="query:ArrayOfString">
						<string>urn:epc:class:lgtin:4012345.011111.4444</string>
					</value>
				</param>
			</params>
		</query:Poll>
	</soapenv:Body>
</soapenv:Envelope>